Repository: rodrigo-pedro/ConversationalIST-Chat-App
Catalog: app/lib/l10n/app_*.arb
Languages: pt

# enterEmail
source: Enter your email
pt: Insira o seu email

# pleaseEnterEmail
source: Please enter your email
pt: Por favor insira o seu email

# enterPassword
source: Enter your password
pt: Insira a sua password

# pleaseEnterPassword
source: Please enter your password
pt: Por favor insira a sua password

# enterUsername
source: Enter your username
pt: Insira o nome de usuário

# pleaseEnterUsername
source: Please enter your username
pt: Por favor insira o nome de usuário

source: Signup
pt: Registar

source: Login
pt: Entrar

# invalidCredentials
source: Invalid email or password
pt: Email ou palavra-passe incorretos

# weakPassword
source: The password provided is too weak.
pt: Palavra-passe fraca

# accountInUse
source: The account already exists for that email.
pt: Conta já existe

source: Unable to register.
pt: Não é possivel registar.

# joinChatPrompt
source: Are you sure you join the chat?
pt: Tem a certeza que quer participar na conversa?

source: Cancel
pt: Cancelar

source: Yes
pt: Sim

# chooseLocation
source: Choose your location
pt: Escolha a sua localização

source: Awaiting result...
pt: Aguardando resultado...

# signWithAccount
source: Sign in with account
pt: Iniciar sessão com conta

# usernameExists
source: Username already exists
pt: Nome de usuário já existente

# signWithoutAccount
source: Sign in without account
pt: Iniciar sessão sem conta

# leaveChatPrompt
source: Are you sure you want to leave the chat?
pt: Tem a certeza que quer abandonar a conversa?

# rejoinLater
source: You can rejoin later.
pt: Pode juntar-se mais tarde

source: Public
pt: Pública

source: Private
pt: Privada

source: Georestricted
pt: Georestrita

source: Create chatroom
pt: Criar sala de conversa

source: Welcome
pt: Bem vindo

# convertAccount
source: Convert into account
pt: Converter em conta

source: Sign Out
pt: Terminar sessão

source: Send location
pt: Enviar localização

source: Join
pt: Entrar em

source: Chats
pt: Conversas

source: Search
pt: Procurar

# searchForChatroom
source: Search for a chatroom
pt: Procurar por uma sala

source: Chatroom name
pt: Nome da sala

# radius
source: Radius (meters)
pt: Raio (metros)

source: Write message...
pt: Escrever mensagem...

source: New location
pt: Nova localização

# desiredLocation
source: This is your desired location
pt: Esta é a localização escolhida

source: Current location
pt: Localização atual

# whereYouAre
source: This is where you are
pt: Está aqui
